{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v4.19.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of14.bin", "group1-shard2of14.bin", "group1-shard3of14.bin", "group1-shard4of14.bin", "group1-shard5of14.bin", "group1-shard6of14.bin", "group1-shard7of14.bin", "group1-shard8of14.bin", "group1-shard9of14.bin", "group1-shard10of14.bin", "group1-shard11of14.bin", "group1-shard12of14.bin", "group1-shard13of14.bin", "group1-shard14of14.bin"], "weights": [{"name": "tf_bert_for_sequence_classification/bert/embeddings/word_embeddings/weight", "shape": [30522, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/embeddings/token_type_embeddings/embeddings", "shape": [2, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/embeddings/position_embeddings/embeddings", "shape": [512, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/embeddings/LayerNorm/gamma", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/embeddings/LayerNorm/beta", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/self/query/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/self/query/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/self/key/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/self/key/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/self/value/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/self/value/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/output/dense/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/output/dense/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/output/LayerNorm/gamma", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/output/LayerNorm/beta", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/intermediate/dense/kernel", "shape": [312, 1200], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/intermediate/dense/bias", "shape": [1200], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/output/dense/kernel", "shape": [1200, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/output/dense/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/output/LayerNorm/gamma", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/output/LayerNorm/beta", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/self/query/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/self/query/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/self/key/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/self/key/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/self/value/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/self/value/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/output/dense/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/output/dense/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/output/LayerNorm/gamma", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/output/LayerNorm/beta", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/intermediate/dense/kernel", "shape": [312, 1200], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/intermediate/dense/bias", "shape": [1200], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/output/dense/kernel", "shape": [1200, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/output/dense/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/output/LayerNorm/gamma", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/output/LayerNorm/beta", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/self/query/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/self/query/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/self/key/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/self/key/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/self/value/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/self/value/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/output/dense/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/output/dense/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/output/LayerNorm/gamma", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/output/LayerNorm/beta", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/intermediate/dense/kernel", "shape": [312, 1200], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/intermediate/dense/bias", "shape": [1200], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/output/dense/kernel", "shape": [1200, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/output/dense/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/output/LayerNorm/gamma", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/output/LayerNorm/beta", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/self/query/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/self/query/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/self/key/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/self/key/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/self/value/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/self/value/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/output/dense/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/output/dense/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/output/LayerNorm/gamma", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/output/LayerNorm/beta", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/intermediate/dense/kernel", "shape": [312, 1200], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/intermediate/dense/bias", "shape": [1200], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/output/dense/kernel", "shape": [1200, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/output/dense/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/output/LayerNorm/gamma", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/output/LayerNorm/beta", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/pooler/dense/kernel", "shape": [312, 312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/pooler/dense/bias", "shape": [312], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/classifier/kernel", "shape": [312, 2], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/classifier/bias", "shape": [2], "dtype": "float32"}]}]}